---
kind: other
id: Methods.T:Autodesk.Revit.DB.PointOnEdgeFaceIntersection
source: html/46b494da-87c5-5423-bac5-cac5d2eb7245.htm
---
# PointOnEdgeFaceIntersection Methods

Get a copy of the edge or curve reference.